base/Documents/бит_му_ОбесценениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ОбесценениеОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийОбесценениеОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыДвиженияОбесценения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимость</Name>
							<Comment>Балансовая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозмещаемаяСтоимость</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбесценения</Name>
							<Comment>Причина обесценения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_ПричиныОбесцененияВНА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСниженияСтоимости</Name>
							<Comment>Счет снижения стоимости</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовРасходов</Name>
							<Comment>Счет доходов/расходов от обесценения ОС</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_му_ВидыОперацийОбесценениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыОперацийОбесценениеОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_ВидыДвиженияОбесценения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыДвиженияОбесценения</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_ВидыКлассовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыКлассовОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ОбесценениеОС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ВалютаМеждУчета Экспорт; // Хранит валюту международного учета

Перем КоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

Перем ВидыКлассовВидыОпераций Экспорт; // Хранит соответствие классов и видов операций.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_му_ОбесценениеОС.ПодготовитьПараметрыПроведения(Ссылка);
		
	ПроверитьТаблицыДокумента(ПараметрыПроведения.Реквизиты, ПараметрыПроведения, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Документы.бит_му_ОбесценениеОС.СформироватьДвиженияМеждународныйУчет(ПараметрыПроведения, Движения); 
	
	Документы.бит_му_ОбесценениеОС.СформироватьДвиженияСобытияОС(ПараметрыПроведения, Движения);
	
	Документы.бит_му_ОбесценениеОС.СформироватьДвиженияПараметрыОС(ПараметрыПроведения, Движения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли;	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтруктураНеДублирующихсяПолей = Новый Структура;
	СтруктураНеДублирующихсяПолей.Вставить("ОсновноеСредство");
	
	// Проверим наличие дублей в табличной части "ОсновныеСредства".
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
																	 ,"ОсновныеСредства"
																	 ,СтруктураНеДублирующихсяПолей
																	 ,Отказ);
																	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
		
	// Заполним шапку документа значениями по умолчанию.
    бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
		
	Дата = ТекущаяДатаСеанса();
	
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	
	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;
	
КонецПроцедуры

// Процедура синхронизирует значения реквизитов типа "СправочникСсылка.ОсновныеСредства"
// строки табличной части ОсновныеСредства. 
// 
// Параметры:
//  ТекущаяСтрока - ДокументТабличнаяЧастьСтрока.бит_му_ОбесценениеОС.ОсновныеСредства.
// 
Процедура СинхронизироватьРеквизитыОС(ТекущаяСтрока) 
	
	Если ТекущаяСтрока = Неопределено Тогда 		
		Возврат; 		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ОсновноеСредство) Тогда
		
		Для Ном = 1 По КоличествоСубконтоМУ Цикл
			
			ИмяСубконто = "Субконто" + Ном;
			Если ТипЗнч(ТекущаяСтрока[ИмяСубконто]) = Тип(бит_ОбщегоНазначения.ПолучитьИмяТипаОсновныеСредства()) Тогда
				ТекущаяСтрока[ИмяСубконто] = ТекущаяСтрока.ОсновноеСредство;   				
			КонецЕсли; 
			
		КонецЦикла; // По субконто
		
	КонецЕсли; 
	
КонецПроцедуры // СинхронизироватьРеквизитыОС()

// Процедура выполняет проверку таблицы ОС.
// 
// Параметры:
//  СтруктураТаблиц  - Структура
//  Отказ            - Булево
//  Заголовок        - Строка
// 
Процедура ПроверитьТаблицыДокумента(СтруктураШапкиДокумента,СтруктураТаблиц,Отказ)  
	
	КолонкиТаблицы = СтруктураТаблиц.ОсновныеСредства.Колонки;
	
	Для каждого СтрокаТаблицы Из СтруктураТаблиц.ОсновныеСредства Цикл
				
		НачалоСообщения = НСтр("ru='В строке №%1 табличной части ""Основные средства""';
							   |en='The line №%1 tabular part of ""Fixed assets""'");
		НачалоСообщения = СтрШаблон(НачалоСообщения,СтрокаТаблицы.НомерСтроки);
		
		// Проверка на принятие к учету, выбытие и финансовую аренду.
		бит_му_ВНА.ПроверитьСтрокуТаблицыОС(СтрокаТаблицы, КолонкиТаблицы,СтруктураШапкиДокумента, Отказ);							   
		
		// Проверка соответствия вида класса виду операции документа.
		Если ВидыКлассовВидыОпераций[СтрокаТаблицы.ВидКласса] <> СтруктураШапкиДокумента.ВидОперации Тогда
			
			ТекстСообщения = НСтр("ru = 'вид класса ""%1"" основного средства ""%2"" не соответствует виду операции документа.'; 
			                      |en = 'class type ""%1"" of fixed asset ""%2"" does not match the document transaction type.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ВидКласса, СтрокаТаблицы.ОсновноеСредство);
			ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
		КонецЕсли; 
		
		// Проверка модели учета
		ПараметрыКласса = СтруктураТаблиц.ПараметрыКлассов[СтрокаТаблицы.Класс];
		флУчетПоПервоначальнойСтоимости = Ложь;
		Если ПараметрыКласса <> Неопределено Тогда
			флУчетПоПервоначальнойСтоимости = ?(ПараметрыКласса.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПервоначальнойСтоимости,Истина,Ложь);
		КонецЕсли; 
		
		Если НЕ флУчетПоПервоначальнойСтоимости Тогда
			
			ТекстСообщения = НСтр("ru = 'указано основное средство ""%1"" учитываемое НЕ по первоначальной(исторической) стоимости. Обесценение невозможно.'; 
			                      |en = 'indicated fixed asset ""%1"" not accounted for at historical (historical) value. Impairment is not possible.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,СтрокаТаблицы.ОсновноеСредство);			
			ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли; 
		
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_му_ВидыОперацийОбесценениеОС.ОсновныеСредства Тогда
			
			// Проверки на начисление амортизации в текущем и следующем периодах.
			Если НЕ СтрокаТаблицы.НачисленаТекущий
				И (НЕ СтруктураШапкиДокумента.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения
				И СтрокаТаблицы.БалансоваяСтоимость <> 0) Тогда
				
				ТекстСообщения = НСтр("ru = 'указано основное средство ""%1"", по которому не начислена амортизация в текущем периоде.'; 
				                      |en = 'fixed asset ""%1"" is indicated for which depreciation has not been accrued in the current period.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,СтрокаТаблицы.ОсновноеСредство);
				ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;  
			
			Если СтрокаТаблицы.НачисленаСледующий Тогда
				
				ТекстСообщения = НСтр("ru = 'указано основное средство ""%1"", по которому начислена амортизация в следующих периодах.'; 
				                      |en = 'fixed asset ""%1"" is indicated for which depreciation has been accrued in the following periods.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,СтрокаТаблицы.ОсновноеСредство);
				ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 				
			
		КонецЕсли; 
		
		// При формировании резерва проверка на превышение ликвидационной стоимости.
		Если СтруктураШапкиДокумента.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ФормированиеРезерва 
			И СтрокаТаблицы.ВозмещаемаяСтоимость < СтрокаТаблицы.ЛиквидационнаяСтоимость Тогда
			
			ТекстСообщения = НСтр("ru = 'указана возмещаемая стоимость: %1 меньше ликвидационной стоимости: %2.'; 
			                      |en = 'the recoverable amount is indicated:%1 less than the residual value: %2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,
			                           бит_ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.ВозмещаемаяСтоимость,ВалютаДокумента,"0.00"),
									   бит_ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.ЛиквидационнаяСтоимость,ВалютаДокумента,"0.00"));
			ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли; 
		
		Если СтруктураШапкиДокумента.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда
			
			// При возврате проверка на наличие формирования резерва.
			Если СтрокаТаблицы.ДатаФормированияРезерва >= СтруктураШапкиДокумента.Дата Тогда
				
				ТекстСообщения = НСтр("ru = 'указано основное средство ""%1"", по которому ранее не было проведено формирование резерва. Возврат обесценения невозможен.'; 
				                      |en = 'fixed asset ""%1"" is indicated for which reserve formation has not previously been made. No impairment is possible.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,СтрокаТаблицы.ОсновноеСредство);
				ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
			// Проверка возмещаемой стоимости
			КонтрольнаяСумма = СтрокаТаблицы.БалансоваяСтоимостьНач-СтрокаТаблицы.СуммаАмортизации;
			Если КонтрольнаяСумма < СтрокаТаблицы.ВозмещаемаяСтоимость Тогда
				
				ТекстСообщения = НСтр("ru = 'возмещаемая стоимость: %1 больше чем первоначальная стоимость за минусом амортизации по первоначальным параметрам: %2. Возврат обесценения невозможен.'; 
				                      |en = 'recoverable amount: %1 more than the initial cost minus depreciation in accordance with the initial parameters: %2. No impairment is possible.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,
				                           бит_ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.ВозмещаемаяСтоимость,ВалютаМеждУчета),
										   бит_ОбщегоНазначения.ФорматСумм(КонтрольнаяСумма,ВалютаМеждУчета));
				ТекстСообщения = НачалоСообщения + " " + ТекстСообщения;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
		КонецЕсли; // Возврат обесценения
		
	КонецЦикла; // По строкам таблицы	
	
КонецПроцедуры // ПроверитьТаблицыДокумента()

#КонецОбласти

#Область Инициализация

КоличествоСубконтоМУ = 4;

ВидыКлассовВидыОпераций = Новый Соответствие();
ВидыКлассовВидыОпераций.Вставить(Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства
                                  ,Перечисления.бит_му_ВидыОперацийОбесценениеОС.ОсновныеСредства);
ВидыКлассовВидыОпераций.Вставить(Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность
                                  ,Перечисления.бит_му_ВидыОперацийОбесценениеОС.ИнвестиционнаяСобственность);								  

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
